IDENTIFICATION DIVISION.
PROGRAM-ID. HelloWorld.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 COUNTER PIC 9(8) VALUE 0.
PROCEDURE DIVISION.
    PERFORM VARYING COUNTER FROM 1 BY 1 UNTIL COUNTER > 1000000
        DISPLAY "Line " COUNTER ": DISPLAY 'Hello World'".
    END-PERFORM.
    STOP RUN.
